"""
[Title/Звание]
FinanceFlow: Опростена банкова система с възможност за менежиране на личните финанси.

[Description/Обрисовка]
FinanceFlow е уеб приложение, което комбинира функционалностите на банкови услуги 
и личен "финансов мениджър". Приложението позволява на потребителите да създават
банкови акаунти, да извършват депозити и трансакции, и да следят разходите си чрез удобна система 
за бюджетиране. FinanceFlow ще има възможността да изпраща имейл на потребителя, при надвишаване на месечния бюджет.
В допълнение, може би ще интегрира PayPal API за реални депозити. 

[Functionalities/Надарености]
Note: Подфункционалностите със * ще бъдат допълнителни, в случай, че ми остане време да ги направя :)

FinanceFlow ще предоставя следните функционалности на своите потребители:
1. Автентикация:
    - Регистрация и вход.
   
2. Банкови акаунти:
    - Създаване на виртуални банкови акаунти с избор между типове: обикновен(текущ) и спестовен.
        - Текущ акаунт - неограничен брой трансакции. Без лихва (т.е балансът на потребителят няма да 
            нараства с времето).
        - Спестовен акаунт - ограничен брой трансакции (максимум 5 тегления и прехвърляния на месец).
            Висока лихва от 2% месечно върху баланса, която се добавя автоматично върху баланса. 

3. Трансакции
    - Трансакции между различни потребители на платформата.
    - Възможност за депозити и тегления.
    - Поддържане на минимални и максимални лимити на трансакциите.
    - Представяне на история на всички трансакции.
    - *Вътрешни трансакции между различните акаунти на потребителя

4. Бюджетиране(Достъпно само за текущите акаунти):
    - Планиране на месечни бюджети по категории (напр. храна, забавления, транспорт).
    - Изчисляване на цялостен месечен бюджет и следене за неговото ненадвишаване при трансакции.
    - Известия по имейл при надвишаване на бюджета.
    - *Получаване на малък процент (0.2%) лихва върху баланса при ненадвишен месечен бюджет

5. *Интеграции:
    - PayPal API: За реални депозити.
    
6. *Изчисляване на лихви (за момента лихвата ще бъде фиксирана на 2% за спестовния акаунт):
    - Месечно начисляване на лихви за спестовни акаунти чрез Celery.
    - Автоматична актуализация на баланса.

[Milestones/Възлови точки]
1. Модул с базовата логика на приложението
    - backbone - модул, съединяващо звено между отделните модули на приложението

2. Модул за регистрация и вход:
    - Логика за управление на потребители.

3. Модул за управление на банкови акаунти:
    - Създаване, изтриване и редактиране на акаунти.
    - Избор на тип акаунт (текущ/спестовен).

4. Модул за трансакции:
    - Депозиране и теглене на средствата.
    - Външни трансакции между потребители.
    - *Вътрешни трансакции между различните сметки на потребителя.

5. Модул за бюджетиране:
    - Създаване на месечен бюджет.
    - Следене на бюджета спрямо трансакциите.
    - Изпращане на имейл, ако бюджетът бъде надвишен.

*6. Модул за интеграция с PayPal API:
    - Реални депозити и проследяване на трансакции.

*7. Front-end модул (но само ако ми остане време)

[Estimate in man-hours/Времеоценка в човекочасове]
~ 60-65 часа, горе долу по един ден за всеки модул(дори ми се струва амбициозно)

[Usage of technologies/Потребление на технологии]
    - основно Django
    - Django REST за PayPal API-то
    - HTML, CSS, JavaScript за front-end частта
    - GitHub for version control.
"""